[{"objectID":"B79A548688886B479DB3A812292901E3","title":"Algolia Settings","description":"ALGOLIA INTEGRATION  Integrate YouDoCMS with the Algolia  https://www.algolia.com/  cloud for fast site search .   Algolia Install  Single click installation of the Algolia node modules. This will install the latest versions of Algolia search from Github    Algolia Setup  Create an Algolia account and copy your application ID, admin API key and index name into YouDoCMS settings - search. In addition for compatibility with JSON-LD structured data include the URL of your target search page. This can be any page that includes the search input box. Test your settings and if okay create the index.      Algolia Index  The simplest way to implement Algolia is the start with an existing page that shows a list from a blog or a category. Using a listing page as a template follow the instructions below to create a version of the page which incorporates Algolia search.  Template Search Box  The simplest way to implement Algolia is the start with an existing page that shows a list from a blog or a category. Using a listing page as a template follow the instructions below to create a version of the page which incorporates Algolia search. Algolia requires 2 empty div's within your template to insert the search results and paginate. Plus we also need the ID of the div to insert the search box. From your existing html copy the divs for the search box. In our example The Algolia search box replaces the content inside the  form  tag. In the search.js file we include the classes from the div we have replaced.   Template Search Results  To include the search results you need to embed to div's where the IDs match those in the search.js file. In this case we are using #hitlist for the results and #pagination. Place the div's where you would like the search results to appear in the page.   Search JavaScript  To enable Algolia search on the site you need to create an include a JavaScript file. This is quite straightforward please see the example below which you can copy and paste after updating your API key.","path":"support/cloud-settings/search","author":"Paul Dennis","publish_date":"2021-05-27","metadesc":"Include Algolia search in your YouDoCMS pages.","keywords":["Algolia Search","Static Site Search"],"synonyms":[""],"category":{"title":"Search","description":"<h2 class=\"mb-5\">Search and SEO</h2>\n<div class=\"alert alert-blue alert-icon mb-6\" role=\"alert\"><i class=\"uil uil-exclamation-circle\"></i>Integrate YouDoCMS with the <a href=\"https://www.algolia.com/\" target=\"_blank\" rel=\"noopener\">Algolia </a>cloud for fast site search and optimise your search results with JSON-LD<span style=\"font-family: var(--bs-body-font-family); font-size: var(--bs-body-font-size); font-weight: var(--bs-body-font-weight); text-align: var(--bs-body-text-align); word-spacing: 0.05rem;\">.</span></div>\n<div class=\"card\">\n<div class=\"card-body\">\n<h4>Algolia Index</h4>\n<p>Using dot notation<span>&nbsp;</span><code>page_o</code><span>&nbsp;</span>is the page object and within the page object are collections and entities representing the data for the page.</p>\n<h4>JSON-LD</h4>\n<p><a href=\"https://json-ld.org/\" target=\"_blank\" rel=\"noopener\">JSON-LD structured data is a standardized format for providing information about a page</a>. It is easy for humans to read and write and used by Goolge which reads the JSON-LD formatted structured data to index your pages. YouDoCMS simplifies the creation of JSON-LD element for each page when the site is built.</p>\n</div>\n</div>","metadesc":""}}]